# Неуспешный вход в учетную запись с пустым паролем

## id 137

**Тип:** *негативный, функицональный*

**Тестовые данные:**
- Логин: standard_user
- Пароль: значение отсутствует
- Сайт: [Swag Labs](saucedemo.com)

**Предусловие:**
1. Открыть браузер
2. Перейти на сайт [Swag Labs](saucedemo.com)
3. Страница авторизации загружена, поля логина и пароля активны

**Шаги:** 
1. В поле ввода логина ввести "standard_user"
2. Поле ввода пароля оставить пустым
3. Нажать кнопку «Login»

**Ожидаемый результат:** 
1. На экран выведено сообщение об ошибке "Epic sadface: Password is required"
2. Вход в систему не был выполнен
3. Страница логина загружена, поля логина и пароля активны
4. Поле ввода логина остается заполненным
5. Поле ввода пароля остается пустым


**Фактический результат:** 
//заполняется после прохождения тест кейса\\
